README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>README</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="README"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-07-18 23:14:35 EDT"/>
<meta name="author" content="Neil Smithline"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">README</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Experiments In Time Tracking</h2>
<div class="outline-text-2" id="text-1">

<p>This repository is now and will likely always be a <a href="http://en.wikipedia.org/wiki/Work_in_progress">WIP</a>. I plan to use this repository as a record of both my thoughts and experiments as well as a home for related software if any is needed.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Motivation</h2>
<div class="outline-text-2" id="text-2">

<p>It wasn't until I heard about the <a href="http://en.wikipedia.org/wiki/Quantified_Self">Quantified Self</a> movement a few weeks ago that I started to contemplate combining my:
</p><ul>
<li>Interest in bettering my time management skills.
</li>
<li>Love for gadgets, in this instance, my Android smartphone.
</li>
<li>Large yet ever growing love of <a href="http://orgmode.org">Org Mode</a> for Emacs.
</li>
<li>Recent discovery of <a href="https://github.com/novoid/Memacs">Memacs</a> and ongoing discussions with Memacs' author <a href="https://github.com/novoid">novoid</a> (AKA: <a href="https://twitter.com/n0v0id">@n0v0id</a>).
</li>
<li>Nerdy "talents" though I've hard them called other things&hellip;
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">My Goal</h2>
<div class="outline-text-2" id="text-3">

<p>Being an analytical kind of guy, my hope is that if I can keep accurate records of how I use my time I will be able to analyze and improve my time management skills going forward. Essentially, I am thinking that the best way for me to improve my time management skills is simply to better understand how I use my time. Once I understand that, designing strategies for better time management seems simple.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Not For Everyone</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">Record Keeping Is Difficult</h3>
<div class="outline-text-3" id="text-4-1">

<p>Keeping detailed records of how you use your time is difficult. For starters, you need some means of recording your time usage with you at all times. This means you need to keep a notepad, a computer, a smartphone, a pad of stickies, or whatever with you at all times. This is a non-issue for me as I'm never far from my phone.
</p>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">Detailed Record Keeping Is Even More Difficulterer!</h3>
<div class="outline-text-3" id="text-4-2">

<p>While I won't know until I have some actual experience using the system, detailed record keeping can be difficult. My current thinking is that I want to record what I am doing about every 20 minutes. In order to make this task manageable, I won't try to subdivide a 20 minute block. When I'm notified, likely via some sort of recurring timer, I will record what I was doing when I was notified. If I've done several things in the 20 minutes prior to notification, they'll go unrecorded.
</p>
<p>
My hope is that recording my activities every 20 minutes will give me a sufficiently accurate understanding of my time usage. Assuming that I'm asleep 8 hours a day, I should note my activities 3 times an hour for 16 hours. That's 48 records per day.
</p>
<p>
I imagine that I'll end up with less than 48 records each day. I certainly can imagine myself ignoring the notification if I'm engrossed in something. I also wonder if I'll want to bother record keeping near the end of the day. That is my downtime and, at least at the moment, I don't see myself wishing to intrude upon it with record keeping.
</p>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3">Detailed Time Usage Records Does Not Guarantee Better Time Management</h3>
<div class="outline-text-3" id="text-4-3">

<p>This entire project is based on the assumption that if I have better data about how I spend my time that it will lead to me developing better time management skills. If this assumption is wrong then this project will have been an exercise wasting time, the exact opposite of its goal. That said, I am certain that being able to analyze my time usage will lead towards me better managing my time.
</p>
<p>
Ironically, it is my poor innate time perception that makes me confident that better data collection and analysis will lead to better time management. As a result of not having functional time perception, I've developed lots of compensatory strategies. Perhaps the most relevant strategy is that I am happy to run my life by the clock, provided that the clock has some means of notifying me to pay attention to it. Otherwise, I forget to look at the clock and end up behind schedule.
</p>
<p>
Recognizing the above facts led me to start carrying a PDA in 1985. I have carried one faithfully ever since; replacing broken or lost ones within days. As such, I'm 100% convinced that if I can achieve sufficiently detailed records of my time, I will develop better time management skills.
</p>
</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4">My Time Management Skills Are Already Perfect</h3>
<div class="outline-text-3" id="text-4-4">

<p>Lucky you. Mine aren't.
</p>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Documentation</h2>
<div class="outline-text-2" id="text-5">

<p>The documentation for this project uses <a href="http://pages.github.com/">Github Pages</a>.
</p>
<p>
Available Pages:
</p><ul>
<li>See the documentation at <a href="http://neil-smithline.github.com/time-tracking-experiments/journal.org">http://neil-smithline.github.com/time-tracking-experiments/journal.org</a>
</li>
</ul>

</div>
</div>
</div>

</body>
</html>
